Repository: dacistul/BrightPath
Catalog: website/translations/*/LC_MESSAGES/messages.po
Languages: ja, ro, zu

source: Home
ja: ホーム
ro: Acasă
zu: Ikhaya

source: Achievements
ja: 実績
ro: Realizări
zu: Izimpumelelo

source: Login
ja: ログイン
ro: Autentificare
zu: Ngena

source: Sign up
ja: サインアップ
ro: Înscriere
zu: Bhalisa

source: My Courses
ja: マイコース
ro: Cursurile mele
zu: Izifundo Zami

source: Upload
ja: アップロード
ro: Încarcă
zu: Layisha

source: Logout
ja: ログアウト
ro: Deconectare
zu: Phuma

source: Language
ja: 言語
ro: Limbă
zu: Ulimi

source: Chat
ja: チャット
zu: Ingxoxo

source: Professors
ja: 教授
ro: Profesori
zu: Othisha

source: Students
ja: 学生
ro: Studenți
zu: Abafundi

source: Send
ja: 送信
ro: Trimite
zu: Thumela

source: Type a message...
ja: メッセージを入力...
ro: Scrie un mesaj...
zu: Bhala umyalezo...

source: 2024 Bright Path. All rights reserved.
ja: 2024 Bright Path. 全著作権所有。
ro: 2024 Bright Path. Toate drepturile rezervate.
zu: 2024 Bright Path. Wonke amalungelo agodliwe.

source: Course overview
ja: コース概要
ro: Prezentarea cursului
zu: Isifundo esibanzi

source: Name
ja: 名前
ro: Nume
zu: Igama

source: Description
ja: 説明
ro: Descriere
zu: Incazelo

source: See
ja: 見る
ro: Vezi
zu: Bona

source: No existing courses.
ja: 既存のコースはありません。
ro: Nu există cursuri.
zu: Azikho izifundo ezikhona.

source: Completed 10 Courses
ja: 10コースを修了
ro: Am terminat 10 cursuri
zu: Qedile Izifundo Ezingu-10

source: Earned after completing 10 courses.
ja: 10コースを修了後に獲得
ro: Câștigat după finalizarea a 10 cursuri.
zu: Kutholwe emva kokuphothula izifundo ezingu-10.

source: Expert Learner
ja: 専門的な学習者
ro: Învățător expert
zu: Umfundi Ohloniphekile

source: Awarded after mastering 5 different topics.
ja: 5つの異なるトピックを習得後に授与
ro: Acordat după stăpânirea a 5 subiecte diferite.
zu: Kunikezwa ngemva kokuphothula izihloko ezihlukene ezingu-5.

source: Top Contributor
ja: トップ貢献者
ro: Contribuitor de top
zu: Umnikeli Ophambili

source: Given to users who contribute regularly to discussions.
ja: 定期的にディスカッションに貢献するユーザーに授与
ro: Acordat utilizatorilor care contribuie regulat la discuții.
zu: Kunikezwa kubasebenzisi abahlanganyela njalo ezingxoxweni.

source: Completed a Specialization
ja: 専門分野を修了
ro: Specializare finalizată
zu: Qedile Uhlaka Oluthile

source: Earned after finishing a complete specialization track.
ja: 完全な専門分野を修了後に獲得
ro: Câștigat după finalizarea unei specializări complete.
zu: Kutholwe ngemva kokuphothula izifundo eziqondile.

source: Top Scorer
ja: トップスコア
ro: Cea mai bună performanță
zu: Umphosa Ophambili

source: Awarded for achieving the highest score on a quiz.
ja: クイズで最高得点を達成した者に授与
ro: Acordat pentru obținerea celui mai mare scor la un test.
zu: Kunikezwa ngokufinyelela isikhumbuzo esiphezulu ekuthatheni izivivinyo.

source: Lifetime Learner
ja: 生涯学習者
ro: Învățător pe viață
zu: Umfundi Ohlala Phakade

source: Given to users who have been on the platform for more than 5 years.
ja: 5年以上プラットフォームに参加しているユーザーに授与
ro: Acordat utilizatorilor care sunt pe platformă de mai mult de 5 ani.
zu: Kunikezwa kubasebenzisi abahlala esikhathini eside kakhulu kuhlelo.

source: Certificates
ja: 証明書
ro: Certificate
zu: Izitifiketi

source: Data Science Certificate
ja: データサイエンス証明書
ro: Certificat în Știința Datelor
zu: Isitifiketi Sezesayensi Zedatha

source: Awarded for completing the Data Science Specialization.
ja: データサイエンス専門分野を修了した者に授与
ro: Acordat pentru finalizarea specializării în Știința Datelor.
zu: Kunikezwa ngemva kokuphothula Uhlaka lwezesayensi Zedatha.

source: Advanced Programming Certificate
ja: 高度なプログラミング証明書
ro: Certificat în Programare Avansată
zu: Isitifiketi Sokufundisa Isoftware

source: Completed after mastering advanced programming concepts.
ja: 高度なプログラミング概念を習得後に修了
ro: Finalizat după stăpânirea conceptelor avansate de programare.
zu: Kupheliswa ngokufunda izifundo zomphumela ophambili.

source: Machine Learning Certificate
ja: 機械学習証明書
ro: Certificat în Învățare Automată
zu: Isitifiketi Sokufunda Komshini

source: Awarded after completing a machine learning course with hands-on projects.
ja: 実際のプロジェクトを伴う機械学習コースを修了後に授与
ro: Acordat după finalizarea unui curs de învățare automată cu proiecte practice.
zu: Kunikezwa ngemva kokuphothula izifundo zokufunda komshini.

source: Category
ja: カテゴリー
ro: Categorie
zu: Isigaba

source: Course Content
ja: コース内容
ro: Conținutul cursului
zu: Okuqukethwe Kwezifundo

source: No courses enroled.
ja: 登録されたコースはありません。
ro: Nu sunt cursuri înscrise.
zu: Azikho izifundo ezifakiwe.

source: Username
ja: ユーザー名
ro: Nume utilizator
zu: Igama Lomsebenzisi

source: Pawssword
ja: パスワード
ro: Parolă
zu: Iphasiwedi

source: New user? Press here!
ja: 新しいユーザーですか？ ここをクリック！
ro: Ești nou? Apasă aici!
zu: Umsebenzisi omusha? Cindezela lapha!

source: Enter your username
ja: ユーザー名を入力
ro: Introduceti numele de utilizator
zu: Faka igama lakho lomsebenzisi

source: Enter your password
ja: パスワードを入力
ro: Introduceti parola
zu: Faka iphasiwedi yakho

source: Re-enter your password
ja: パスワードを再入力
ro: Reintroduceți parola
zu: Phinda ufake iphasiwedi yakho

source: Enter your email
ja: メールアドレスを入力
ro: Introduceti emailul
zu: Faka i-imeyili yakho

source: Account Type
ja: アカウントタイプ
ro: Tipul contului
zu: Uhlobo lwe-akhawunti

source: Student
ja: 学生
zu: Umfundi

source: Professor
ja: 教授
ro: Profesor
zu: Uprofesa

source: Already have an account?
ja: すでにアカウントをお持ちですか？
ro: Ai deja un cont?
zu: Unayo i-akhawunti esivele?

source: Upload Course
ja: コースをアップロード
ro: Încarcă curs
zu: Layisha Izifundo

source: Course Name
ja: コース名
ro: Numele cursului
zu: Igama leSigaba

source: Course Description
ja: コースの説明
ro: Descrierea cursului
zu: Incazelo yeSigaba

source: Course Language
ja: コースの言語
ro: Limbă curs
zu: Ulimi lweSigaba

source: Course Category
ja: コースカテゴリー
ro: Categorie curs
zu: Isigaba seSigaba

source: Course Paragraph
ja: コースの段落
ro: Paragraf curs
zu: Isigaba seSigaba

source: Enroll
ja: 登録
ro: Înscriere
zu: Bhalisa

source: My courses
ja: 私のコース
ro: Cursurile mele
zu: Izifundo zami

source: Course uploaded
ja: コースがアップロードされました
ro: Curs încărcat
zu: Ikhosi ilayishiwe

source: Incorrect password, try again.
ja: パスワードが間違っています。再試行してください。
ro: Parolă incorectă, încearcă din nou.
zu: Iphasiwedi ayilungile, zama futhi.

source: User does not exist.
ja: ユーザーが存在しません。
ro: Utilizatorul nu există.
zu: Umsebenzisi akekho.

source: User already exists. Log in!
ja: ユーザーは既に存在します。ログインしてください！
ro: Utilizatorul există deja. Autentifică-te!
zu: Umsebenzisi usevele ukhona. Ngena ngemvume!

source: Username must be greater than 3 characters
ja: ユーザー名は3文字以上である必要があります
ro: Numele de utilizator trebuie să aibă mai mult de 3 caractere
zu: Igama lomsebenzisi kumele libe ngaphezu kwezinhlamvu ezi-3

source: Password must be greater than 3 characters
ja: パスワードは3文字以上である必要があります
ro: Parola trebuie să aibă mai mult de 3 caractere
zu: Iphasiwedi kumele ibe ngaphezu kwezinhlamvu ezi-3

source: Passwords must match
ja: パスワードが一致する必要があります
ro: Parolele trebuie să coincidă
zu: Amaphasiwedi kumele afane

source: Invalid email format. Please use a valid email (e.g., example@domain.com or example@domain.ro).
ja: 無効なメール形式です。有効なメール（例：example@domain.com または example@domain.ro）を使用してください。
ro: Format de email invalid. Te rugăm să folosești un email valid (ex.: example@domain.com sau example@domain.ro).
zu: Ifomethi ye-imeyili ayilungile. Sicela usebenzise i-imeyili evumelekile (isb. example@domain.com noma example@domain.ro).

source: Account was created
ja: アカウントが作成されました
ro: Contul a fost creat
zu: I-akhawunti idaliwe

source: Logged in successfully as %(account_type)s!
ja: %(account_type)s として正常にログインしました！
ro: Autentificat cu succes ca %(account_type)s!
zu: Ungene ngempumelelo njenge-%(account_type)s!

source: Unroll Course
ja: コースを解除
ro: Retrage-te din curs
zu: Phuma Kwikhosi

source: Chat with
ja: チャット相手
ro: Chat cu
zu: Xoxa no
