Repository: dacistul/BrightPath
Catalog: website/translations/ha/LC_MESSAGES/messages.po
Languages: ha

source: Home
ha: Gida

source: Achievements
ha: Nasarori

source: Login
ha: Shiga

source: Sign up
ha: Rajista

source: My Courses
ha: Koyarwar da nake yi

source: Upload
ha: Loda

source: Logout
ha: Fita

source: Language
ha: Harshe

source: Chat
ha: Tattaunawa

source: Professors
ha: Malamai

source: Students
ha: Dalibai

source: Send
ha: Aika

source: Type a message...
ha: Rubuta saƙo...

source: 2024 Bright Path. All rights reserved.
ha: 2024 Bright Path. Dukkan hakkoki sun ajiye.

source: Course overview
ha: Duba Koyarwa

source: Name
ha: Suna

source: Description
ha: Bayani

source: See
ha: Duba

source: No existing courses.
ha: Babu wani darasi na yanzu.

source: Completed 10 Courses
ha: An kammala Darasi 10

source: Earned after completing 10 courses.
ha: An samu bayan kammala darasi guda 10.

source: Expert Learner
ha: Malam Mai Kwarewa

source: Awarded after mastering 5 different topics.
ha: An ba da kyauta bayan kammala koyan batutuwa 5 daban-daban.

source: Top Contributor
ha: Mai Taimako Mafi Girma

source: Given to users who contribute regularly to discussions.
ha: Ana bayar da wannan kyautar ga masu amfani da ke ba da gudummawa a tattaunawa akai-akai.

source: Completed a Specialization
ha: An kammala Kwarewa

source: Earned after finishing a complete specialization track.
ha: An samu bayan kammala tsarin kwarewa.

source: Top Scorer
ha: Mai Mafi Kyawun Makirci

source: Awarded for achieving the highest score on a quiz.
ha: An ba da kyauta don samun mafi kyawun maki a gwaji.

source: Lifetime Learner
ha: Malam Mai Koyo Har Abada

source: Given to users who have been on the platform for more than 5 years.
ha: Ana bayar da wannan kyautar ga masu amfani da suka kasance a dandalin na fiye da shekaru 5.

source: Certificates
ha: Takardun Shaida

source: Data Science Certificate
ha: Takardar Shaida na Kimiyyar Bayanai

source: Awarded for completing the Data Science Specialization.
ha: An ba da kyauta bayan kammala kwarewa a Kimiyyar Bayanai.

source: Advanced Programming Certificate
ha: Takardar Shaida na Shirin Ingantaccen Lissafi

source: Completed after mastering advanced programming concepts.
ha: An kammala bayan kwarewa a cikin tsare-tsare na shirye-shiryen kwamfuta.

source: Machine Learning Certificate
ha: Takardar Shaida na Koyon Injin

source: Awarded after completing a machine learning course with hands-on projects.
ha: An ba da kyauta bayan kammala darasi a Koyon Injin tare da aikin hannu.

source: Category
ha: Rukunin

source: Course Content
ha: Abun Cikin Darasi

source: No courses enroled.
ha: Babu darussa da aka yi rajista.

source: Username
ha: Sunan Mai Amfani

source: Pawssword
ha: Kalmar Sirri

source: New user? Press here!
ha: Sabon mai amfani? Danna anan!

source: Enter your username
ha: Shigar da sunan mai amfani

source: Enter your password
ha: Shigar da kalmar sirri

source: Re-enter your password
ha: Sake shigar da kalmar sirri

source: Enter your email
ha: Shigar da imel dinka

source: Account Type
ha: Nau'in Asusun

source: Student
ha: Dalibi

source: Professor
ha: Malami

source: Already have an account?
ha: Kana da asusu tuni?

source: Upload Course
ha: Loda Darasi

source: Course Name
ha: Sunan Darasi

source: Course Description
ha: Bayani na Darasi

source: Course Language
ha: Harshe na Darasi

source: Course Category
ha: Rukunin Darasi

source: Course Paragraph
ha: Babi na Darasi

source: Enroll
ha: Yi rajista

source: My courses
ha: Kwasa-kwasan da nake ciki

source: Course uploaded
ha: An ɗora darasi

source: Incorrect password, try again.
ha: Kalmar sirri ba ta daidai ba, sake gwadawa.

source: User does not exist.
ha: Mai amfani bai wanzu ba.

source: User already exists. Log in!
ha: Mai amfani ya riga ya wanzu. Shiga!

source: Username must be greater than 3 characters
ha: Sunan mai amfani dole ya zama fiye da haruffa 3

source: Password must be greater than 3 characters
ha: Kalmar sirri dole ta zama fiye da haruffa 3

source: Passwords must match
ha: Kalmar sirri dole su yi daidai

source: Invalid email format. Please use a valid email (e.g., example@domain.com or example@domain.ro).
ha: Tsarin imel ba daidai ba ne. Don Allah a yi amfani da imel mai inganci (misali, example@domain.com ko example@domain.ro).

source: Account was created
ha: An ƙirƙiri asusu

source: Logged in successfully as %(account_type)s!
ha: An yi nasarar shiga azaman %(account_type)s!

source: Unroll Course
ha: Fice daga Darasi

source: Chat with
ha: Tattauna da
